"""
字符串和正则表达式

"""
# 常用元字符：
# . 匹配除换行符以外任意字符
# .* 任意字符可以重复任意次（也可以是0次 ）
# \d 数字
# \d+ 与*不同的是+必须重复至少一次
# \w 字母数字下划线或汉子
# \s 空白符
# \b 匹配单词的开始或者结束
# ^ 匹配字符串的开始
# $ 匹配字符串的结束
# ---------------------------------------
# 常见限定符：
# *	重复零次或更多次
# +	重复一次或更多次
# ?	重复零次或一次
# {n}	重复n次
# {n,}	重复n次或更多次
# {n,m}	重复n到m次
# ----------------------------------------
# 字符类
# 例如想匹配a,e,i,o,u 只需要[aeiou]就可以
# [0-9] == \d
# [a-z0-9A-Z] == \w
# ----------------------------------------
# 分支条件： |
# 用分隔符来分开不同的规则，从而增加约束
# 分组：()
# 重复多个字符用括号即可，例如： (0\d{2}){3}
# ----------------------------------------
# 反义：
# \W	匹配任意不是字母，数字，下划线，汉字的字符
# \S	匹配任意不是空白符的字符
# \D	匹配任意非数字的字符
# \B	匹配不是单词开头或结束的位置
# [^x]	匹配除了x以外的任意字符
# [^aeiou]	匹配除了aeiou这几个字母以外的任意字符



"""

验证输入用户名和QQ号是否有效并给出对应的提示信息

要求：
用户名必须由字母、数字或下划线构成且长度在6~20个字符之间
QQ号是5~12的数字且首位不能为0

"""

import re


def main_1():
    username = input('请输入用户名: ')
    qq = input('请输入QQ号: ')
    # match函数的第一个参数是正则表达式字符串或正则表达式对象
    # 第二个参数是要跟正则表达式做匹配的字符串对象
    m1 = re.match(r'^[0-9a-zA-Z_]{6,20}$', username)
    if not m1:
        print('请输入有效的用户名.')
    m2 = re.match(r'^[1-9]\d{4,11}$', qq)
    if not m2:
        print('请输入有效的QQ号.')
    if m1 and m2:
        print('你输入的信息是有效的!')


def main_2():
    # 创建正则表达式对象 使用了前瞻和回顾来保证手机号前后不应该出现数字
    pattern = re.compile(r'(?<=\D)1[34578]\d{9}(?=\D)')
    sentence = '''
    重要的事情说8130123456789遍，我的手机号是13512346789这个靓号，
    不是15600998765，也是110或119，王大锤的手机号才是15600998765。
    '''
    # 查找所有匹配并保存到一个列表中
    mylist = re.findall(pattern, sentence)
    print(mylist)
    print('--------华丽的分隔线--------')
    # 通过迭代器取出匹配对象并获得匹配的内容
    for temp in pattern.finditer(sentence):
        print(temp.group())
    print('--------华丽的分隔线--------')
    # 通过search函数指定搜索位置找出所有匹配
    m = pattern.search(sentence)
    while m:
        print(m.group())
        m = pattern.search(sentence, m.end())


if __name__ == '__main__':
    # main_1()
    main_2()
